
# 简单模型配置用于测试
nc: 5  # 类别数
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C2f, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C2f, [256]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C2f, [128]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 2, C2f, [256]]
  - [[3, 6], 1, Detect, [5]]
